# الاسم الصحيح للمستودع (atendai بدلاً من attotech)
FROM atendai/evolution-api:v2.2.2

# ----------------------------------------------------------------
# 1. إعدادات السيرفر
# ----------------------------------------------------------------
ENV SERVER_PORT=8080
ENV SERVER_TYPE=http

# ----------------------------------------------------------------
# 2. إعدادات الأمان
# ----------------------------------------------------------------
ENV AUTHENTICATION_API_KEY=12345

# ----------------------------------------------------------------
# 3. إعدادات الويب هوك (Webhook)
# ------------------
